Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh1-6-v3.tmx
Source language: bo
Languages: en

source: །ཀླུ་རྣམས་ཀྱིས་བསམས་པ། བདག་ཅག་ཀླུ་རྣམས་ནི་རྣམ་པར་ལྟུང་བའི་ལུས་ཅན་ཡིན་པས་མ་ལ་བདག་ཅག་གིས་གདེངས་ཀའི་ཟམ་པས་བཅོམ་ལྡན་འདས་ཆུ་བོ་གང་གཱ་བསྒྲལ་བར་བྱའོ་སྙམ་ནས་དེ་རྣམས་ཀྱིས་གདེངས་ཀའི་ཟམ་པ་བཙུགས་སོ། །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དགེ་སློང་རྣམས་ལ་བཀའ་སྩལ་པ།
en: The nāgas thought, “Since the bodies of nāgas are inferior, let us now have the Blessed One cross the Ganges over a bridge of our expanded hoods.” They then made a bridge with their expanded hoods.

source: དགེ་སློང་དག་ཁྱེད་ཅག་ལས་གང་ཞིག་ལུས་འཕགས་མའི་བུ་ཡུལ་མ་ག་དྷཱའི་རྒྱལ་པོ་མ་སྐྱེས་དགྲའི་གྲུ་ཟམ་ལས་ཆུ་བོ་གང་གཱ་རྒལ་བར་སྤྲོ་བ་དེ་ནི་དེ་ལས་རྒོལ་ཅིག །གང་ཞིག་ཡངས་པ་ཅན་གྱི་ལིཙྪ་བཱི་རྣམས་ཀྱིས་གྲུ་ཟམ་བཙུགས་པ་ལས་སྤྲོ་བ་གང་ཡིན་པ་དེ་ཡང་དེ་ལས་རྒོལ་ཅིག །ང་ཡང་དགེ་སློང་ཀུན་དགའ་བོ་དང་ཐབས་ཅིག་ཀླུ་རྣམས་ཀྱི་གདེངས་ཀའི་ཟམ་པ་ལས་ཆུ་བོ་གང་གཱ་བརྒལ་བར་བྱའོ།
en: The Blessed One said to the monks, “Monks, those of you who wish to cross the Ganges over the bridge of boats of Ajātaśatru, the king of Magadha, son of Vaidehī, should go over that. Those of you who wish to go over the bridge of boats of the people of the Licchavi clan in Vaiśālī should go over that. I, with the monk Ānanda, will cross the Ganges over the bridge of the expanded hoods of the nāgas.”

source: །དེ་ན་ཁ་ཅིག་ནི་ལུས་འཕགས་མའི་བུ་ཡུལ་མ་ག་དྷཱའི་རྒྱལ་པོ་མ་སྐྱེས་དགྲའི་གྲུ་ཟམ་ལས་རྒལ་ཏོ།
en: At that time some monks went over the bridge of boats of Ajātaśatru, the king of Magadha, son of Vaidehī.

source: །ཁ་ཅིག་ནི་ཡངས་པ་ཅན་གྱི་ལིཙྪ་བཱི་རྣམས་ཀྱི་གྲུ་ཟམ་ལས་རྒལ་ཏོ།
en: Some went over the bridge of boats of the people of the Licchavi clan in Vaiśālī.

source: །བཅོམ་ལྡན་འདས་ཀྱིས་ཀྱང་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་དང་ཐབས་ཅིག་ཏུ་ཀླུ་རྣམས་ཀྱི་གདེངས་ཀའི་ཟམ་པ་ལས་རྒལ་ཏོ།
en: And the Blessed One, with the venerable Ānanda, went over the bridge of the expanded hoods of the nāgas.

source: །དེ་ནས་དགེ་བསྙེན་ཞིག་གིས་དེའི་ཚེ་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: Then a lay brother spoke these verses:

source: ཁ་ཅིག་ཟམ་པ་བཙུགས་ནས་ཆུ་བྲན་བོར་ཏེ་རྒྱ་མཚོ་རྒལ།
en: “Having built bridges and leaving brooks behind, some cross the ocean.

source: །སྐྱེ་བོ་རྣམས་ནི་གཟིངས་འཆའ་མཁས་པའི་སྐྱེ་བོ་རྣམས་ཆུ་རྒལ།
en: People construct rafts. The wise ford the river.

source: །སངས་རྒྱས་བཅོམ་ལྡན་བྲམ་ཟེ་རྒལ་བར་གྱུར་ནས་སྐམ་ལ་བཞུགས།
en: The Buddha—Blessed One, Brahmin—who has crossed over the river, stands on dry land.

source: །དགེ་སློང་དག་འདིར་ཁྲུས་བྱེད་ཉན་ཐོས་རྣམས་ནི་གཟིངས་འཆའོ།
en: Monks bathe here. The disciples construct rafts.

source: །གལ་ཏེ་ཀུན་ན་ཆུ་ཡོད་ན། །ཁྲོན་པའི་ཆུས་ནི་ཅི་ཞིག་བྱ།
en: “If there is water everywhere, What need is there for a well?

source: །སྲེད་པའི་རྩ་བ་བཅད་ནས་ནི། །སུ་ཞིག་སྤྱོད་པ་ཚོལ་བར་བྱེད།
en: Having cut off the root of desire, Who would look for something more to do?” VI. Mahāpraṇāda A. The Appearance of King Mahāpraṇāda’s Pillar

source: །བཅོམ་ལྡན་འདས་ཀྱིས་ས་ཕྱོགས་གཞན་ཞིག་ན་མཐོ་ཞིང་མཐོ་བའི་ས་ཕྱོགས་ཞིག་གཟིགས་སོ། །གཟིགས་ནས་ཀྱང་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་ཁྱོད་རྒྱལ་པོ་སྒྲ་ཆེན་འཛིན་གྱི་ལྷའི་མཆོད་སྡོང་སྲིད་དུ་འདོམ་སྟོང་ཡོད་ལ་སྦོམས་སུ་འདོམ་དྲུག་བཅུ་ཡོད་པ། ཐམས་ཅད་གསེར་ལས་བྱས་པ། རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱིས་སྤྲས་པ་ཞིག་ཡོད་དེ།
en: The Blessed One saw a place of high elevation, and said to the venerable Ānanda, “Ānanda, King Mahāpraṇāda had a divine pillar that was a thousand fathoms high and sixty fathoms wide, made entirely of gold and covered with various jewels.

source: སྦྱིན་པ་དག་བྱིན། བསོད་ནམས་དག་བྱས་ནས་ཆུ་བོ་གང་གཱའི་ནང་དུ་བོར་བ་གང་ཡིན་པ་དེ་ལྟ་བར་འདོད་དམ།
en: After he had given donations and made merit, he threw it into the Ganges. Do you want to see it?”

source: བཅོམ་ལྡན་འདས་དེ་ལྟ་བའི་དུས་ལ་བབ་ལགས་སོ།
en: “O Blessed One, it is the right time.

source: །བདེ་བར་གཤེགས་པ་དེའི་ཚོད་ལ་བབ་ལགས་ཏེ།
en: Sugata, it is the right time.

source: བཅོམ་ལྡན་འདས་ཀྱིས་གང་མཆོད་སྡོང་དེ་བསྒྲེང་ན་དགེ་སློང་རྣམས་ལྟ་བར་འགྱུར་ལགས་སོ།
en: If the Blessed One draws the pillar up, the monks will see it.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་འཁོར་ལོ་དང་བཀྲ་ཤིས་དང་། གཡུང་དྲུང་འཁྱིལ་པ་དང་། དྲ་བས་འབྲེལ་པ།
en: The Blessed One then touched the earth with his hand, which was marked with a chakra, swastika, and nandyāvarta and whose fingers were connected with a web;

source: བསོད་ནམས་བརྒྱ་ཕྲག་དུ་མས་བསྐྱེད་པ།
en: which had been generated by hundreds of merits;

source: འཇིགས་པ་རྣམས་དབུགས་འབྱིན་པར་མཛད་པའི་ཕྱག་གིས་ས་ལ་རེག་པར་མཛད་པ་དང་། ཀླུ་རྣམས་ཀྱིས་བསམས་པ། བཅོམ་ལྡན་འདས་ཅིའི་ཕྱིར་ས་ལ་རེག་པར་མཛད་སྙམ་ན། མཆོད་སྡོང་གཟིགས་པར་བཞེད་པར་མཐོང་ངོ་།
en: and which comforts those who are frightened. The nāgas thought, “For the sake of what did the Blessed One touch the earth?” Having thought this, they understood that he wished to see the pillar.

source: །དེ་ནས་དེ་དག་གིས་བསྒྲེང་བ་དང་། དགེ་སློང་རྣམས་ཀྱིས་མཆོད་སྡོང་བལྟ་བར་བརྩམས་སོ།
en: They then raised it, and the monks all gazed at the pillar, save for the venerable Bhaddālin.

source: །ཚེ་དང་ལྡན་པ་ལེགས་ལྡན་ནི་འདོད་པ་ཆུང་བ་ཡིན་པས་མཐའ་གཅིག་ཏུ་སོང་ནས་ཕྱག་དར་ཁྲོད་པ་དག་འཚེམ་མོ།
en: As he was one of few desires, he went to a solitary place and remained sewing his robes of refuse rags.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དགེ་སློང་རྣམས་ལ་བཀའ་སྩལ་པ། དགེ་སློང་དག་མཆོད་སྡོང་ནུབ་པར་འགྱུར་གྱིས་རྟགས་ཟུང་ཤིག་ཅེས་པ་ལས་དེ་ནུབ་པར་གྱུར་ཏོ།
en: Then the Blessed One said to the monks, “Monks, as the pillar is going to sink, grasp its characteristics.” The pillar then sank. B.

source: །སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལ་དགེ་སློང་རྣམས་ཀྱིས་ཞུས་པ།
en: The Former Life of the Monk Bhaddālin

source: བཙུན་པ་དགེ་སློང་རྣམས་མཆོད་སྡོང་ལ་ལྟ་བར་བགྱིད་ན། ཚེ་དང་ལྡན་པ་ལེགས་ལྡན་ནི་འདོད་པ་ཆུང་བས་མཐའ་གཅིག་ཏུ་མཆིས་ནས་ཕྱག་དར་ཁྲོད་པ་འཚེམ་པ་ལ་གཟིགས།
en: The monks asked the Buddha, the Blessed One, “How is it, O Honored One, that while the monks gazed at the pillar, the venerable Bhaddālin, as he is one of few desires, went to a solitary place and remained sewing his robes of refuse rags?

source: ཅི་ལགས་རེ་ཞིག་འདོད་ཆགས་དང་བྲལ་བའི་སླད་དུའམ། འོན་ཏེ་སྔོན་བསྟེན་པའི་སླད་དུ་ལགས།
en: Did he do so because he has abandoned desire or because he attended to the pillar before?

source: གལ་ཏེ་རེ་ཞིག་འདོད་ཆགས་དང་བྲལ་བའི་སླད་དུ་ལགས་ན་ནི་གཞན་ཡང་འདོད་ཆགས་དང་བྲལ་བ་ཞིག་མཆིས་ལགས་སོ།
en: If it was because he has abandoned desire, there are other people who have also abandoned desire.

source: །འོན་ཏེ་སྔོན་བསྟེན་པའི་སླད་དུ་ལགས་ན་ནི། འདིས་གང་དུ་བསྟེན་ལགས།
en: If it was because he attended to the pillar before, where did he attend to the pillar?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དགེ་སློང་དག་འདོད་ཆགས་དང་བྲལ་བའི་ཕྱིར་ཡང་ཡིན་ལ་སྔོན་ཡང་བསྟེན་པའི་ཕྱིར་ཡང་ཡིན་ནོ།
en: “Monks,” the Blessed One replied, “it was both because he has abandoned desire and because he attended to the pillar before.”

source: །འདིས་སྔོན་གང་དུ་བསྟེན་ལགས།
en: “When in the past did he attend to it?”

source: དགེ་སློང་དག་སྔོན་བྱུང་བ་རྒྱལ་པོ་རབ་སྒྲོགས་ཞེས་བྱ་བ་ཞིག་བྱུང་སྟེ། དེ་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་དང་གྲོགས་པོར་གྱུར་ཏོ།
en: “Monks, once there was a king named Praṇāda, who was a friend of Śakra, Lord of the Gods.

source: །དེ་བུ་འདོད་ཀྱང་བུ་མེད་ནས་ལག་པ་ལ་འགྲམ་པ་གཏད་དེ་སེམས་ཁོང་དུ་ཆུད་ཅིང་འདུག་སྟེ་ནོར་རྫས་མང་པོ་ཞིག་བསགས་ན་བདག་ལ་བུ་མེད་པས་བདག་ཤིན་རྒྱལ་པོའི་གདུང་རྒྱུད་ཆད་པར་འགྱུར་རོ་སྙམ་མོ།
en: Although he wished for a son, he was sonless. He was plunged into grief, resting his cheek on his hand, and he thought, ‘Though I have accumulated a mass of property, after my death the royal lineage will end since I do not have a son.’

source: །དེ་ནས་བརྒྱ་བྱིན་གྱིས་མཐོང་ནས་དྲིས་པ། གྲོགས་པོ་ཁྱོད་ཅིའི་ཕྱིར་ལག་པ་ལ་འགྲམ་པ་གཏད་ནས་སེམས་ཁོང་དུ་ཆུད་ཅིང་འདུག །དེས་སྨྲས་པ།
en: “Then Śakra saw him and asked, ‘O my friend, why are you plunged into grief, resting your cheek on your hand?’

source: ཀཽ་ཤི་ཀ་ནོར་རྫས་འདི་སྙེད་ཅིག་བསགས་ན་བདག་ལ་བུ་མེད་པས་བདག་ཤི་ནས་རྒྱལ་པོ་གདུང་རྒྱུད་ཆད་པར་འགྱུར་བས་སོ།
en: “ ‘O Kauśika,’ the king replied, ‘it is because, though I have accumulated such a mass of property, after my death the royal lineage will end since I do not have a son.’

source: །བརྒྱ་བྱིན་གྱིས་སྨྲས་པ། གྲོགས་པོ་ཁྱོད་སེམས་ཁོང་དུ་ཆུད་པར་མ་བྱེད་ཅིག །གལ་ཏེ་ལྷའི་བུ་འགའ་ཞིག་འཆི་འཕོའི་ཆོས་བྱུང་བར་གྱུར་ན། དེ་ཁྱོད་ཀྱི་བུར་བསྐོ་བར་བྱའོ།
en: “ ‘O my friend,’ said Śakra, ‘you should not be plunged into grief. If some god is destined to die, I shall make him be reborn as your son.’

source: །ཆོས་ཉིད་ཀྱིས་ལྷའི་བུ་འཆི་འཕོའི་ཆོས་འབྱུང་བ་ལ་ནི་སྔ་ལྟས་ལྔ་འབྱུང་བར་འགྱུར་ཏེ།
en: “It is natural that five omens appear to a god who is destined to die:

source: གོས་མ་རྙིངས་པ་རྣམས་རྙིངས་པར་འགྱུར་བ་དང་། མེ་ཏོག་གི་ཕྲེང་བ་མ་རྙིངས་པ་རྣམས་རྙིངས་པར་འགྱུར་བ་དང་། ལུས་ལས་དྲི་མི་ཞིམ་པ་འབྱུང་བ་དང་། མཆན་ཁུང་ནས་རྔུལ་འཛག་པ་དང་། རང་གི་སྟན་ལ་མི་དགའ་བར་འགྱུར་བའོ།
en: his garments that have not been worn out become worn out; his garland that has not wilted becomes wilted; a foul odor issues from his body; sweat oozes from his armpits; and he feels uncomfortable on his seat.

source: །ཇི་ཙམ་ན་ལྷའི་བུ་ཞིག་ལ་སྔ་ལྟས་ལྔ་བྱུང་བར་གྱུར་ནས་དེ་ལ་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་སྨྲས་པ།
en: “Just then, the five omens appeared to a god.

source: གྲོགས་པོ་རྒྱལ་པོ་རབ་སྒྲོགས་ཀྱི་བཙུན་མོ་དམ་པའི་མངལ་དུ་ཉིང་མཚམས་སྦྱོར་ཅིག །དེས་སྨྲས་པ།
en: Śakra, Lord of the Gods, said to him, ‘O my friend, enter the womb of King Praṇāda’s chief consort.’

source: ཀཽ་ཤི་ཀ་དེ་ནི་བག་མེད་པའི་གནས་ཡིན་ཏེ།
en: “ ‘O Kauśika,’ said the god, ‘that is grounds for carelessness.

source: ཀཽ་ཤི་ཀ་རྒྱལ་པོ་རྣམས་ནི་ཉེས་པ་མང་པོ་བྱེད་པ་ཡིན་པས་ཆོས་མ་ཡིན་པས་རྒྱལ་སྲིད་བྱས་ནས་སེམས་ཅན་དམྱལ་བར་གཞོལ་བར་གྱུར་ན་མི་རུང་ངོ་།
en: O Kauśika, because kings commit much misconduct, I will, having unlawfully ruled over the kingdom, go to hell, which I do not want.’

source: །བརྒྱ་བྱིན་གྱིས་སྨྲས་པ། གྲོགས་པོ་ཁྱོད་ལ་ངས་དྲན་པར་བྱའོ།
en: “ ‘O my friend, I will remind you,’ Śakra reassured him.

source: །ཀཽ་ཤི་ཀ་ལྷ་རྣམས་ནི་དགའ་བ་མང་པོས་བག་མེད་པ་ཡིན་ནོ།
en: “ ‘O Kauśika, gods are careless, since they enjoy much pleasure.’

source: །གྲོགས་པོ་དེ་ནི་བདེན་ན་འོན་ཀྱང་ཁོ་བོས་ཁྱོད་ལ་དྲན་པར་བྱའོ།
en: “ ‘Indeed they are, my friend. But I will remind you.’

source: །དེས་རྒྱལ་པོ་རབ་སྒྲོགས་ཀྱི་བཙུན་མོ་དམ་པའི་མངལ་དུ་ཉིང་མཚམས་སྦྱར་ཏོ།
en: “The god entered the womb of King Praṇāda’s chief consort.

source: །གང་གི་ཉི་མ་ཁོ་ན་ལ་ཉིང་མཚམས་བླངས་པ་དེའི་ཉི་མ་ཁོ་ན་ལ་སྐྱེ་བོའི་ཚོགས་ཆེན་པོས་སྒྲ་ཕྱུང་བར་གྱུར་ཏོ།
en: On the day that he entered the womb, a large crowd raised a cry.

source: །དེ་ཟླ་བ་བརྒྱད་དམ་དགུ་འདས་ནས་ཁྱེའུ་ཞིག་བཙས་ཏེ་ཞེས་བྱ་བ་ནས།
en: After eight or nine months, a boy was born.

source: སྣའི་གཟངས་མཐོ་བ་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་ནོ།
en: He was well proportioned . . . and he had a prominent nose.

source: །དེའི་ཉེ་དུ་དག་འདུས་ཤིང་ཚོགས་ནས་མིང་འདོགས་པར་བྱེད་དེ། ཁྱེའུའི་མིང་ཅིར་གདགས།
en: The king’s kinsmen assembled and, wishing to give the baby a name, they said, ‘What name shall we give this boy?’

source: གཉེན་རྣམས་ཀྱིས་སྨྲས་པ། གང་གི་ཉི་མ་ཁོ་ན་ལ་ཁྱེའུ་འདི་མའི་མངལ་དུ་ཞུགས་པ་དེའི་ཉི་མ་ཁོ་ན་ལ་སྐྱེ་བོའི་ཚོགས་ཆེན་པོས་སྒྲ་ཕྱུང་བར་གྱུར་པས།
en: “The kinsmen said, ‘Since on the day that the boy entered the mother’s womb a large crowd raised a cry (nāda), let us name him Mahāpraṇāda.’

source: དེ་བས་ན་ཁྱེའུའི་མིང་སྒྲ་ཆེན་ཞེས་བྱ་བར་གདགས་སོ་ཞེས་དེའི་མིང་སྒྲ་ཆེན་ཞེས་བྱ་བར་བཏགས་ཏེ།
en: “Thus the boy was named Mahāpraṇāda.

source: ཁྱེའུ་སྒྲ་ཆེན་མ་མ་བརྒྱད་ལ་རྗེས་སུ་གཏད་ནས་ཞེས་བྱ་བ་ནས་བརྟག་པ་བརྒྱད་དང་། དབྱེ་བ་དང་། ཀློག་པ་ལ་མཁས་ཤིང་བཤེས་གཉེན་ཅན་དུ་གྱུར་ཏོ་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ།
en: The boy Mahāpraṇāda was entrusted to eight nursemaids . . . and he became fully learned in eight kinds of analysis, and he also mastered other kinds of analysis and reading, and became one whose actions are clear.

source: །དེ་རྒྱལ་རིགས་སྤྱི་བོ་ནས་དབང་བསྐུར་ཅིང་ཡུལ་གྱི་དབང་ཕྱུག་དང་མཐུ་དང་། བརྩོན་འགྲུས་ཐོབ་པ། སའི་དཀྱིལ་འཁོར་ཆེན་པོ་མངོན་པར་ཟིལ་གྱིས་མནན་ནས་གནས་པ་རྣམས་ཀྱི་བཟོའི་གནས་དང་ལས་ཀྱི་གནས་ཐ་དད་པ་གང་ཡིན་པ་འདི་ལྟ་སྟེ། གླང་པོ་ཆེའི་གཉར་ཞོན་པ་དང་། རྟ་ལ་ཞོན་པ་དང་། ཤིང་རྟའི་ཐབས་དང་། རལ་གྲིའི་ཐབས་དང་། མདའ་གཞུ་དང་། ཕྱིར་བསྣུར་བ་དང་། མདུན་དུ་བསྣུར་བ་དང་། ལྕགས་ཀྱུས་སྒྱུར་ཐབས་དང་། ཞགས་པས་གདབ་པ་དང་། མདའ་བོ་ཆེ་འཕེན་པ་དང་། དབྱུག་པས་རྡེག་པ་དང་། འཛིན་སྟངས་དང་། གོམ་སྟངས་དང་། གཅོད་པ་དང་། དྲལ་བ་དང་། དབུག་པ་དང་། རྒྱང་ནས་ཕོག་པ་དང་། སྒྲ་གྲག་པར་ཕོག་པ་དང་། གནད་དུ་ཕོག་པ་དང་། མི་འཆོར་བར་ཕོག་པ་དང་། ཚབས་ཆེ་བ་དག་སྟེ། གནས་ལྔ་པོ་དེ་རྣམས་ལ་ཤིན་ཏུ་བྱང་བར་གྱུར་ཏོ།
en: “ He became fully learned in the various arts and technical skills of kṣatriyas who have been anointed and have attained dominance, mastery, and sovereignty over the kingdom and have conquered vast lands, namely, riding on the neck of an elephant, riding a horse, handling a chariot, handling a sword and a bow and arrow, retreating and advancing, taming elephants, handling a noose, handling a spear, handling a cudgel, clenching the fist, pacing, cutting, tearing, piercing, and the five arts of shooting, namely, shooting from afar, shooting at a sound, shooting at a vital part, shooting without being noticed, and shooting truly.

source: །ཆོས་ཉིད་ཀྱིས་རེ་ཞིག་ཕ་ཇི་ཙམ་གསོན་གྱི་བར་དུ་བུའི་མིང་མི་གྲག་པ་ཡིན་ནོ།
en: “It is commonplace that a son’s name is not known while his father is alive.

source: །དུས་གཞན་ཞིག་ན་རྒྱལ་པོ་རབ་སྒྲོགས་ཤི་ནས་སྒྲ་ཆེན་རྒྱལ་སྲིད་ལ་བཞག་པ་དང་། དེས་ཐ་གི་ཙམ་ཞིག་ཆོས་བཞིན་གྱིས་རྒྱལ་སྲིད་བྱེད་དུ་བཅུག་ནས།
en: Later, King Praṇāda died and Mahāpraṇāda ascended the throne.

source: དེ་ནས་ཆོས་བཞིན་མ་ཡིན་པས་རྒྱལ་སྲིད་བྱེད་དུ་བཅུག་པར་གྱུར་ཏོ།
en: After having lawfully ruled over the kingdom for a while, he began to rule over the kingdom unlawfully.

source: །དེ་ནས་བརྒྱ་བྱིན་གྱིས་སྨྲས་པ། གྲོགས་པོ་ཁོ་བོས་ཁྱོད་རྒྱལ་པོ་རབ་སྒྲོགས་ཀྱི་བུར་བསྐོས་ཏེ་ཆོས་བཞིན་མ་ཡིན་པས་རྒྱལ་སྲིད་མ་བྱེད་ཅིག །སེམས་ཅན་དམྱལ་བར་གཞོལ་བར་གྱུར་ཏ་རེ་ཞེས་མ་བསྒོའམ།
en: Then Śakra said to him, ‘O my friend, did I not, when I assigned you as the son of King Praṇāda, tell you not to rule over the kingdom unlawfully lest you should go to hell?’

source: དེས་ཐ་གི་ཙམ་ཞིག་ཆོས་བཞིན་གྱིས་རྒྱལ་སྲིད་བྱེད་དུ་བཅུག་ནས་སླར་ཡང་ཆོས་བཞིན་མ་ཡིན་པས་རྒྱལ་སྲིད་བྱེད་དུ་བཅུག་པར་གྱུར་ཏོ།
en: “Then the king, having lawfully ruled over the kingdom for a while, again began to rule over the kingdom unlawfully.

source: །ལན་གཉིས་སུ་ཡང་བརྒྱ་བྱིན་གྱིས་སྨྲས་པ། གྲོགས་པོ་ཁོ་བོས་ཁྱོད་རྒྱལ་པོ་རབ་སྒྲོགས་ཀྱི་བུར་བསྐོས་ཏེ་ཆོས་བཞིན་མ་ཡིན་པས་རྒྱལ་སྲིད་མ་བྱེད་ཅིག །སེམས་ཅན་དམྱལ་བར་གཞོལ་བར་གྱུར་ཏ་རེ་ཞེས་མ་བསྒོའམ།
en: Again, Śakra said to him, ‘O my friend, did I not, when I assigned you as the son of King Praṇāda, tell you not to rule over the kingdom unlawfully lest you should go to hell?’

source: དེས་སྨྲས་པ། ཀཽ་ཤི་ཀ་བདག་ཅག་རྒྱལ་པོ་རྣམས་ནི་དགའ་བ་མང་པོས་བག་མེད་པས་སྐད་ཅིག་ཏུ་བརྗེད་པར་འགྱུར་གྱིས།
en: “ ‘O Kauśika,’ replied the king, ‘since we kings enjoy much pleasure, we quickly forget things through carelessness.

source: བདག་ལ་ཁྱོད་ཀྱིས་མཚན་མ་ཞིག་ཞོག་ཤིག་དང་། བདག་གིས་མཐོང་ནས་ངེས་པར་སྦྱིན་པ་དག་སྦྱིན། བསོད་ནམས་དག་བགྱིའོ།
en: Please leave a reminder for me, so when I see it, I will certainly give donations and make merit.’

source: །དེ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་ལྷའི་བུ་ལས་ཐམས་ཅད་པ་ལ་བསྒོ་བ། ལས་ཐམས་ཅད་པ་སོང་ལ་ཁྱོད་ཀྱིས་རྒྱལ་པོ་སྒྲ་ཆེན་གྱི་གནས་སུ་ལྷའི་འཁོར་གྱི་ཁྱམས་དང་། ལྷའི་མཆོད་སྡོང་སྲིད་དུ་འདོམ་སྟོང་ཡོད་ལ། སྦོམས་སུ་འདོམ་དྲུག་བཅུ་ཡོད་པ།
en: “Then Śakra, Lord of the Gods, ordered the god Viśvakarman, ‘O Viśvakarman, go and produce, in the palace of King Mahāpraṇāda, a divine courtyard and a divine pillar that is a thousand fathoms high and sixty fathoms wide, made entirely of gold, and covered with various jewels.’

source: ཐམས་ཅད་གསེར་ལས་བྱས་ཤིང་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱིས་སྤྲས་པ་ཞིག་སྤྲུལ་ཅིག །དེ་ནས་ལྷའི་བུ་ལས་ཐམས་ཅད་པས་རྒྱལ་པོ་སྒྲ་ཆེན་གྱི་གནས་སུ་ལྷའི་འཁོར་གྱི་ཁྱམས་དང་། ལྷའི་མཆོད་སྡོང་སྲིད་དུ་འདོམ་སྟོང་ཡོད་པ། སྦོམས་སུ་འདོམ་དྲུག་བཅུ་ཡོད་པ། ཐམས་ཅད་གསེར་ལས་བྱས་པ། རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱིས་སྤྲས་པ་ཞིག་སྤྲུལ་ཏོ།
en: “The god Viśvakarman then did produce, in the palace of King Mahāpraṇāda, a divine courtyard and a divine pillar that was a thousand fathoms high and sixty fathoms wide, made entirely of gold, and covered with various jewels.

source: །དེ་ནས་རྒྱལ་པོ་སྒྲ་ཆེན་གྱིས་མཆོད་སྦྱིན་གྱི་ཁང་པ་རྩིག་ཏུ་བཅུག་ནས་རང་གི་ཞང་པོ་མྱ་ངན་མེད་ཅེས་བྱ་བ་མཆོད་སྡོང་གི་ཞལ་ཏ་བར་བཞག་གོ།
en: King Mahāpraṇāda then had an offering hall built, and appointed Aśoka, his uncle on his mother’s side, as the manager of the pillar.

source: །དེ་ནས་མཆོད་སྡོང་ལ་འཛམ་བུའི་གླིང་ན་གནས་པའི་མི་ཐམས་ཅད་ལྟ་བར་སྤྲོ་བས་ལྷགས་ནས་ཟས་ཟོས་ཤིང་མཆོད་སྡོང་ལྟ་བས་རང་གི་ལས་སྒྲུབ་པར་མི་བྱེད་དོ།
en: “Thereupon all the people living on the continent of Jambu gathered to see the pillar. They continued to stare at the pillar even while eating their meals and did not do their own work.

source: །དེ་ནས་ཞིང་ལས་ཀྱི་མཐའ་རྣམས་བར་ཆད་བྱས་པས་རྒྱལ་པོའི་དཔྱ་ཐང་བཞིན་མི་འདུ་བར་གྱུར་ཏོ།
en: As a result, the crops failed and the king’s taxes were not paid.

source: །བློན་པོ་རྣམས་ཀྱིས་དཔྱ་ཉུང་ངུ་ཕུལ་བ་དང་རྒྱལ་པོ་སྒྲ་ཆེན་གྱིས་སྨྲས་པ། ཤེས་ལྡན་དག་ཅིའི་ཕྱིར་དཔྱ་ཉུང་ཟད་གཅིག་འབུལ།
en: When the ministers presented only a small amount of tax to the king, King Mahāpraṇāda asked them, ‘Sirs, why are you presenting only a small amount of tax?’

source: ལྷ་འཛམ་བུའི་གླིང་ན་གནས་པའི་སྐྱེ་བོའི་ཚོགས་མཆིས་ནས་འཚལ་མ་འཚལ་ཅིང་མཆོད་སྡོང་ལ་ལྟ་ཞིང་མཆིས་ཏེ་རང་གི་ལས་སྒྲུབ་པར་མི་བྱེད་པས་ཞིང་ལས་ཀྱི་མཐའ་རྣམས་ཀྱི་བར་ཆད་བགྱིས་པས་དཔྱ་ཐང་བཞིན་མི་འདུ་ལགས་སོ། །རྒྱལ་པོས་སྨྲས་པ།
en: “ ‘Your Majesty, all the people living on the continent of Jambu have gathered to see the pillar. They have continued to stare at the pillar even while eating their meals and do not do their own work. Therefore, the crops have failed and the taxes have not been paid.’ “ ‘Destroy the pillar’s offering hall!’ ordered the king.

source: མཆོད་སྦྱིན་གྱི་ཁང་པ་དྲོལ་ཅིག །དེ་རྣམས་ཀྱིས་དེ་དྲལ་ན་ཡང་དེ་བཞིན་དུ་སྐྱེ་བོའི་ཚོགས་དེ་རང་རང་གི་རྒྱགས་བླངས་ནས་ཟ་ཞིང་མཆོད་སྡོང་ལ་རྟོག་ཅིང་འདུག་སྟེ།
en: “Even after they had destroyed it, the people still gathered there as before, bringing food with them, and they continued to stare at the pillar even while eating their meals and did not do their own work.

source: རང་རང་གི་ལས་སྒྲུབ་པར་མི་བྱེད་པས་ཞིང་ལས་ཀྱི་མཐའ་རྣམས་ཀྱི་བར་ཆད་བྱས་པས་དེ་བཞིན་རྒྱལ་པོའི་དཔྱ་ཐང་བཞིན་མི་འདུ་བར་གྱུར་ཏོ།
en: Since the crops failed, the taxes were not paid.

source: །རྒྱལ་པོས་དྲིས་པ། ཤེས་ལྡན་དག་མཆོད་སྦྱིན་གྱི་ཁང་པ་དྲལ་ན་ཅིའི་ཕྱིར་ད་དུང་དཔྱ་ཉུང་བར་གྱུར། བློན་པོ་རྣམས་ཀྱིས་སྨྲས་པ།
en: The king asked them, ‘Sirs, why are the taxes dwindling, even though you have destroyed the offering hall?’ “ ‘Your Majesty,’ the ministers responded, ‘the people have still gathered there as before, bringing food with them.

source: ལྷ་སྐྱེ་བོའི་ཚོགས་རང་རང་གི་རྒྱགས་བླངས་ནས་འཚལ་ཞིང་མཆོད་སྡོང་ལ་རྟོག་ཅིང་མཆིས་ཏེ་རང་གི་ལས་སྒྲུབ་པར་མི་བགྱིད་པས།
en: They stare at the pillar even while eating their meals and do not do their own work.

source: ཞིང་ལས་ཀྱི་མཐའ་རྣམས་ཀྱི་བར་ཆད་བགྱིས་པས་དེས་ན་དཔྱ་ཉུང་བར་གྱུར་ཏོ།
en: Therefore, the crops have failed and the taxes are dwindling.’

source: །དེ་ནས་རྒྱལ་པོ་སྒྲ་ཆེན་གྱིས་སྦྱིན་པ་དག་སྦྱིན། བསོད་ནམས་དག་བྱས་ནས་མཆོད་སྡོང་ཆུ་བོ་གང་གཱའི་ནང་དུ་བོར་རོ།
en: “Thereupon King Mahāpraṇāda, having given donations and made merit, sank the pillar into the Ganges.

source: རྒྱལ་པོ་རབ་སྒྲོགས་ཀྱི་ཞང་པོ་མྱ་ངན་མེད་ཅེས་བྱ་བ་གང་ཡིན་པ་དེ་ནི་དགེ་སློང་ལེགས་ལྡན་འདི་ཉིད་ཡིན་ཏེ།
en: That one who was King Mahāpraṇāda’s uncle, Aśoka, was indeed this monk Bhaddālin.

source: འདིས་སྔོན་འདི་བསྟེན་ཏོ། །བཙུན་པ་མཆོད་སྡོང་འདི་གང་དུ་ཞིག་པར་འགྱུར་ལགས།
en: And so he once attended to this pillar.” C. The Prediction of the Appearance of the Buddha Maitreya and the Wheel-Turning King Śaṅkha “Honored One, on what occasion will this pillar be destroyed?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དགེ་སློང་དག་མ་འོངས་པ་ན་མི་རྣམས་ཀྱིས་ཚེ་ལོ་བརྒྱད་ཁྲི་ཐུབ་པར་འགྱུར་ཏེ།
en: “Monks,” the Blessed One explained, “in the future, the human lifespan will be eighty thousand years.

source: མི་ཚེ་ལོ་བརྒྱད་ཁྲི་པ་རྣམས་ཀྱི་རྒྱལ་པོ་དུང་ཞེས་བྱ་བ་ཡང་དག་པར་སྡོམ་པ། འཁོར་ལོས་སྒྱུར་བ་མཐའ་བཞིར་རྣམ་པར་རྒྱལ་བ། ཆོས་དང་ལྡན་པ་ཆོས་ཀྱི་རྒྱལ་པོ་རིན་པོ་ཆེ་སྣ་བདུན་དང་ལྡན་པ་ཞིག་འབྱུང་བར་འགྱུར་རོ།
en: Among the people whose lifespan is eighty thousand years, there will appear a king named Śaṅkha, a wheel-turning king who is in control of himself and has conquered the border regions in the four directions, a righteous Dharma king who has attained the seven treasures.

source: །དེའི་རིན་པོ་ཆེ་སྣ་བདུན་ནི་འདི་ལྟ་བུ་དག་འབྱུང་བར་འགྱུར་ཏེ། འདི་ལྟ་སྟེ།
en: His seven treasures will be these:

source: འཁོར་ལོ་རིན་པོ་ཆེ་དང་། གླང་པོ་རིན་པོ་ཆེ་དང་། རྟ་རིན་པོ་ཆེ་དང་། ནོར་བུ་རིན་པོ་ཆེ་དང་། བུད་མེད་རིན་པོ་ཆེ་དང་། ཁྱིམ་བདག་རིན་པོ་ཆེ་དང་། བདུན་པ་ནི་བློན་པོ་རིན་པོ་ཆེ་ཉིད་དོ།
en: the precious chakra, elephant, horse, jewel, woman, householder, and minister.

source: །དེ་ལ་བུ་དཔའ་བ། རྟུལ་ཕོད་པ། ཡན་ལག་མཆོག་གི་གཟུགས་དང་ལྡན་པ། ཕ་རོལ་གྱི་སྡེ་རབ་ཏུ་འཇོམས་པར་བྱེད་པ་སྟོང་ཡང་ཚང་བར་འབྱུང་བར་འགྱུར་ཏེ།
en: He will have a thousand sons who will be brave, bold, and endowed with excellent physiques, and who will defeat the enemy’s army.

source: དེ་རྒྱ་མཚོ་ལ་ཐུག་པའི་ས་ཆེན་པོ་མ་ལུས་པར་གནོད་པར་སྡོ་བ་མེད་ཅིང་འཚེ་བ་མེད་པ་འདི་ཉིད་ཆད་པ་མེད་ཅིང་མཚོན་གྱིས་བདའ་བ་མེད་ལ། ཆོས་དང་མཐུན་ཞིང་སྙོམས་པས་ལེགས་པར་ཕབ་སྟེ་གནས་པར་འགྱུར་རོ།
en: He will conquer the land entirely, as far as the seashore, without risking harm, without violence, without punishment or weapons, but in accord with the Dharma and impartially.

source: །རྒྱལ་པོ་དུང་གི་མདུན་ན་འདོན་བྲམ་ཟེ་ཚངས་པའི་ཚེ་ཞེས་བྱ་བ་ཞིག་འབྱུང་སྟེ།
en: “King Śaṅkha will have a brahmin named Brahmāyus, who will be chief priest of the country.

source: དེའི་ཆུང་མ་ནི་ཚངས་ལྡན་མ་ཞེས་བྱ་བ་ཞིག་འབྱུང་ངོ་།
en: The brahmin will have a wife named Brahmāvatī.

source: །དེ་བྱམས་པ་ཚད་མེད་པའི་ཡན་ལག་གིས་རྒྱས་པར་བྱས་པས་བུ་བྱམས་པ་ཞེས་བྱ་བ་ཞིག་བཙའ་བར་འགྱུར་རོ།
en: She will, having filled the world with immeasurable love, have a son named Maitreya (Loving).

source: །བྲམ་ཟེ་ཚངས་པའི་ཚེ་བྲམ་ཟེའི་ཁྱེའུ་བརྒྱད་ཁྲི་ལ་བྲམ་ཟེ་རྣམས་ཀྱི་གསང་ཚིག་ཀློག་ཏུ་འཇུག་གོ།
en: The brahmin Brahmāyus will teach brahmanical mantras to eighty thousand young brahmins.

source: །དེས་བྲམ་ཟེའི་ཁྱེའུ་དེ་རྣམས་བྱམས་པ་ལ་གཏད་ནས་བྲམ་ཟེའི་ཁྱེའུ་བྱམས་པས་བྲམ་ཟེའི་ཁྱེའུ་བརྒྱད་ཁྲི་པོ་རྣམས་བྲམ་ཟེ་རྣམས་ཀྱི་གསང་ཚིག་ཀློག་ཏུ་འཇུག་གོ།
en: He will entrust the young brahmins to Maitreya, and the young brahmin Maitreya will teach brahmanical mantras to the eighty thousand young brahmins.

source: །དེ་ནས་རྒྱལ་པོ་ཆེན་པོ་བཞི་པོ་རྣམས་ཀྱིས་གཏེར་ཆེན་པོ་བཞི་པོ།
en: “Thereupon the Four Great Kings will bring four great treasures, namely:

source: ཀ་ལིང་ཀ་ནས་དམར་སེར་ཏེ།
en: “Piṅgala from Kaliṅga,

source: །མི་ཐི་ལ་ནས་སྐྱ་བོ་ཡི།
en: Pāṇḍuka from Mithilā,

source: །ས་འཛིན་ནས་ནི་ཨེ་ལའི་འདབ།
en: Elāpatra from Gāndhāra,

source: །བཱ་རཱ་ཎ་སཱིའི་གྲོང་ནས་དུང་།
en: And Śaṅkha from Vārāṇasī,

source: །མཆོད་སྡོང་འདི་ཡང་ཁྱེར་ནས་རྒྱལ་པོ་དུང་ལ་འབུལ་བར་འགྱུར་རོ།
en: “and this pillar, and they will offer them to King Śaṅkha.

source: །རྒྱལ་པོ་དུང་གིས་ཀྱང་བྲམ་ཟེ་ཚངས་པའི་ཚེ་ལ་སྦྱིན་པར་འགྱུར་རོ། །བྲམ་ཟེ་ཚངས་པའི་ཚེས་ཀྱང་བྲམ་ཟེའི་ཁྱེའུ་བྱམས་པ་ལའོ། །བྲམ་ཟེའི་ཁྱེའུ་བྱམས་པས་ཀྱང་བྲམ་ཟེའི་ཁྱེའུ་དེ་རྣམས་ལའོ།
en: King Śaṅkha will give them to the brahmin Brahmāyus, the brahmin Brahmāyus to the young brahmin Maitreya, and the young brahmin Maitreya to the young brahmins.

source: །དེ་ནས་བྲམ་ཟེའི་ཁྱེའུ་དེ་རྣམས་ཀྱིས་མཆོད་སྡོང་དེ་དུམ་བུ་དུམ་བུར་བཅད་ནས་འགེད་པར་འགྱུར་རོ།
en: Thereupon the young brahmins will break the pillar into pieces and divide the pieces.

source: །དེ་ནས་བྲམ་ཟེའི་ཁྱེའུ་བྱམས་པས་མཆོད་སྡོང་དེའི་མི་རྟག་པ་ཉིད་མཐོང་ནས། དེ་ཉིད་ཀྱིས་སྐྱོ་བ་སྐྱེས་ནས་ནགས་སུ་འགྲོ་བར་འགྱུར་རོ།
en: Then the young brahmin Maitreya, having realized the impermanence of the pillar and experienced grief, will go to the forest.

source: །གང་གི་ཉི་མ་ཁོ་ན་ལ་ནགས་སུ་སོང་བ་དེ་ཁོ་ནའི་ཉི་མ་ལ་བྱམས་པ་ཚད་མེད་པའི་ཡན་ལག་གིས་རྒྱས་པར་བྱས་ནས་བླ་ན་མེད་པའི་ཡེ་ཤེས་ཐོབ་པར་འགྱུར་ཏེ།
en: On the very day when he goes to the forest, having filled the world with immeasurable love, he will attain supreme knowledge.

source: དེའི་མཚན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་བྱམས་པ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་བྱམས་པ་ཞེས་བྱ་བར་འགྱུར་རོ།
en: His name will be the Supremely Perfectly Awakened One Maitreya.

source: །གང་གི་ཉི་མ་ཁོ་ན་ལ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་བྱམས་པས་བླ་ན་མེད་པའི་ཡེ་ཤེས་ཐོབ་པར་འགྱུར་བ་དེ་ཁོ་ནའི་ཉི་མ་ལ་རྒྱལ་པོ་དུང་གི་རིན་པོ་ཆེ་སྣ་བདུན་ནུབ་པར་འགྱུར་རོ།
en: “On the very day when the Perfectly Awakened One Maitreya attains supreme knowledge, the seven treasures of King Śaṅkha will disappear.
